latex/the_pizza_ontology.tex

\section{The Pizza Ontology}
\label{sec-5}

\subsection{Introduction}
\label{sec-5-1}

In this section, we will create a Pizza ontology; we choose pizzas because
they are simple, well-understood and compositional (see \href{http://robertdavidstevens.wordpress.com/2010/01/22/why-the-pizza-ontology-tutorial/}{here} for more).

We have described ontologies more abstractly \hyperref[what_is_an_ontology]{earlier}. More concretely, in this
book, an ontology is a computational object, which can contain a number of
different objects. These objects can be of several different kinds. The most
(and least!) important of these are \emph{individuals}. We say that these are the
most important because it is these individuals that are described and
constrained by the other objects. We say that they are the least important
because, in practice, many ontologies do not explicitly describe any
individuals at all.

If this seems perverse, consider a menu in a pizza shop. We might seem
an item described saying "Margherita\ldots{}.£5.50". The menu makes no
statements at all about an individual pizza. It is saying that any
margherita pizza produced in this resturant is going to (or already has)
cost £5.50. From the menu, we have no idea how many margherita pizzas
have been produced or have been consumed. But, menu is still useful. The
menu is comprehensive, tells you something about all the pizzas that
exist (at least in one resturant) and the different types of pizza. This
is different to the bill, which describes individuals -- the pizzas that
have actually been provided, how many pizza and how much they all cost.
In ontology terms, the menu describes the \textbf{classes}, the bill describes
individuals \footnote{The analogy between a pizza menu and an ontology
is not perfect. With pizza, people are generally happy with the classes
(i.e. the menu) and start arguing once about the individuals (i.e. the
bill); with ontologies it tends to be the other way around}. OWL
Ontologies built with Tawny-OWL \emph{can} describe either or both of these
entities but in most cases focus on classes.
