org/the_pizza_ontology.org
** Defining Classes

We start with a namespace form. This declaration is slightly different from
that given in [[Getting Started][Getting Started]]; it includes a ~:use~ statement for
~tawny.english~. We 



and a statement declaring a new ontology. First, consider the syntax of
this example, because it is shared by all statements in Tawny-OWL. All
expresions in Clojure are delimited by ~(~ and ~)~ and Tawny-OWL follows
this rule. Next, we have a name for the object we wish to create -- in
this case an new ontology. This starts with ~def~ to indicate that we
also want to create a new symbol which we can use to refer to this
entity later.

Finally, come a set of arguments, introduced with /keywords/. These all
end with a ~:~. In this case, ~:iri~ introduces the main IRI for this
ontology, which is a global identifier, and finally a string which is
the actual value of that argument.

#+BEGIN_SRC clojure
(ns take.wing.the-pizza-ontology
  (:use [tawny.owl]
        [tawny.english])
  (:refer-clojure :only []))

(defontology pizza :iri "http://purl.org/ontolink/take-wing/pizza")
#+END_SRC


The semantics of this statement are quite interesting. If we had created
a new database, by default, the database would be considered to be empty
-- that is there would be no individuals in it. With an ontology, the
opposite is true. By default, we assume that there could be any number
of individuals. As of yet, we just have not said anything about these
individuals.

Next, we declare two classes. A class is a set of individuals with
shared characteristics. For now, we create two classes, ~Pizza~ and
~PizzaComponent~. As with our ~defontology~ form, have a ~def~ form;
however, in this case, we do not use any arguments. The semantics of
these two statements are that, there is a class called ~Pizza~ and
another called ~PizzaComponent~ which individuals may be members of.
However, we know nothing at all about the relationship between an
individual ~Pizza~ and an individual ~PizzaComponent~.


#+BEGIN_SRC clojure
(defclass Pizza)
(defclass PizzaComponent)
#+END_SRC

To build an accurate ontology, we may wish to describe this relationship
further. We might ask the question, can an individual be both a ~Pizza~
and a ~PizzaComponent~ at the same time. The answer to this is no, but
currently our ontology does not state this. In OWL terminology, we wish
to say that these two classes are /disjoint/. We can achieve this by
adding an ~as-disjoint~ statement.

#+BEGIN_SRC clojure
(as-disjoint Pizza PizzaComponent)
#+END_SRC

This works well, but is a little duplicative. If we add a new class
which we wish to also be disjoint, it must be added in two places.
Instead, it is possible to do both at once [fn:: In the source code,
generated from this book, we are now defining both classes twice, as we
have two ~defclass~ statements for each. This will actually work okay,
although it is not best practice as it is somewhat dependent on the
implementation details of the OWL API.]. This has the advantage of
grouping the two classes together in the file, as well as semantically,
which should make the source more future-proof; should we need new
classes, we will automatically make them disjoint as required.

#+BEGIN_SRC clojure
(as-disjoint
 (defclass Pizza)
 (defclass PizzaComponent))
#+END_SRC

The semantics of these statements are that our ontology may have any
number of individuals, some of which may be ~Pizza~, some of which may
be ~PizzaComponent~, but none of which can be both ~Pizza~ and
~PizzaComponent~ at the same time. Before we added the ~as-disjoints~
statement, we would have assumed that it was possible to be both.

As well as describing that two classes are different, we may also wish
to describe that they are closely related, or that they are
/subclasses/. Where one class is a subclass of another, we are saying
that everything that is true of the superclass is also true of the
subclass. Or, in terms of individuals, that every individual of the
subclass is also an individual of the superclass.

Next, we add two more classes and include the statement that they have
~PizzaComponent~ as a superclass. We do this by adding a ~:super~
argument or /frame/ to our ~defclass~ statement. In Tawny-OWL the frames
can all be read in the same way. Read forwards, we can say ~PizzaBase~
has a superclass ~PizzaComponent~, or backwards ~PizzaComponent~ is a
superclass of ~PizzaBase~. Earlier, we say the ~:iri~ frame for
~defontology~ which is read similarly -- ~pizza~ has the given IRI.

As every individual of, for example, ~PizzaBase~ is ~PizzaComponent~, and no
~PizzaComponent~ individual can also be a ~Pizza~ this also implies that no
~PizzaBase~ is a ~Pizza~. In otherwords, the disjointness is inherited
[fn:: In this ontology, we use a naming scheme using CamelCase, upper case
names for classes and, later, lower case properties. As with many parts of
ontology development, opinions differ as to whether this is good. With
Tawny-OWL it has the fortuitous advantage that it syntax-highlights nicely,
because it looks like Java]

#+BEGIN_SRC clojure
(defclass PizzaBase
  :super PizzaComponent)
(defclass PizzaTopping
  :super PizzaComponent)
#+END_SRC


As with the disjoint statement, this is little long winded; we have to name
the ~PizzaComponent~ superclass twice. Tawny-OWL provides a short cut for
this, with the ~as-subclasses~ function.

#+BEGIN_SRC clojure
(as-subclasses
 PizzaComponent
 (defclass PizzaBase)
 (defclass PizzaTopping))
#+END_SRC

We are still not complete; we asked the question previously, can you be both a
~Pizza~ and a ~PizzaComponent~, to which the answer is no. We can apply the
same question, and get the same answer to a ~PizzaBase~ and ~PizzaTopping~.
These two, therefore, should also be disjoint. However, we can make a stronger
statement still. The only kind of ~PizzaComponent~ that there are either a
~PizzaBase~ or a ~PizzaTopping~. We say that the ~PizzaComponent~ class is
/covered/ by its two subclasses. We can add both of these statements to the
ontology also.

#+BEGIN_SRC clojure
(as-subclasses
 PizzaComponent
 :disjoint :cover
 (defclass PizzaBase)
 (defclass PizzaTopping))
#+END_SRC

We now have the basic classes that we need to describe a pizza.


