latex/the_pizza_ontology.tex



\subsection{Defining Classes}
\label{sec-5-2}

We start with a namespace form. This declaration is slightly different from
that given in \hyperref[sec-4]{Getting Started}; it includes a \verb~:use~ statement for
\verb~tawny.english~. We 



and a statement declaring a new ontology. First, consider the syntax of
this example, because it is shared by all statements in Tawny-OWL. All
expresions in Clojure are delimited by \verb~(~ and \verb~)~ and Tawny-OWL follows
this rule. Next, we have a name for the object we wish to create -- in
this case an new ontology. This starts with \verb~def~ to indicate that we
also want to create a new symbol which we can use to refer to this
entity later.

Finally, come a set of arguments, introduced with \emph{keywords}. These all
end with a \verb~:~. In this case, \verb~:iri~ introduces the main IRI for this
ontology, which is a global identifier, and finally a string which is
the actual value of that argument.

\begin{tawny}
(ns take.wing.the-pizza-ontology
  (:use [tawny.owl]
	[tawny.english])
  (:refer-clojure :only []))

(defontology pizza :iri "http://purl.org/ontolink/take-wing/pizza")
\end{tawny}


The semantics of this statement are quite interesting. If we had created
a new database, by default, the database would be considered to be empty
-- that is there would be no individuals in it. With an ontology, the
opposite is true. By default, we assume that there could be any number
of individuals. As of yet, we just have not said anything about these
individuals.

Next, we declare two classes. A class is a set of individuals with
shared characteristics. For now, we create two classes, \verb~Pizza~ and
\verb~PizzaComponent~. As with our \verb~defontology~ form, have a \verb~def~ form;
however, in this case, we do not use any arguments. The semantics of
these two statements are that, there is a class called \verb~Pizza~ and
another called \verb~PizzaComponent~ which individuals may be members of.
However, we know nothing at all about the relationship between an
individual \verb~Pizza~ and an individual \verb~PizzaComponent~.


\begin{tawny}
(defclass Pizza)
(defclass PizzaComponent)
\end{tawny}

To build an accurate ontology, we may wish to describe this relationship
further. We might ask the question, can an individual be both a \verb~Pizza~
and a \verb~PizzaComponent~ at the same time. The answer to this is no, but
currently our ontology does not state this. In OWL terminology, we wish
to say that these two classes are \emph{disjoint}. We can achieve this by
adding an \verb~as-disjoint~ statement.

\begin{tawny}
(as-disjoint Pizza PizzaComponent)
\end{tawny}

This works well, but is a little duplicative. If we add a new class
which we wish to also be disjoint, it must be added in two places.
Instead, it is possible to do both at once \footnote{In the source code,
generated from this book, we are now defining both classes twice, as we
have two \verb~defclass~ statements for each. This will actually work okay,
although it is not best practice as it is somewhat dependent on the
implementation details of the OWL API.}. This has the advantage of
grouping the two classes together in the file, as well as semantically,
which should make the source more future-proof; should we need new
classes, we will automatically make them disjoint as required.

\begin{tawny}
(as-disjoint
 (defclass Pizza)
 (defclass PizzaComponent))
\end{tawny}

The semantics of these statements are that our ontology may have any
number of individuals, some of which may be \verb~Pizza~, some of which may
be \verb~PizzaComponent~, but none of which can be both \verb~Pizza~ and
\verb~PizzaComponent~ at the same time. Before we added the \verb~as-disjoints~
statement, we would have assumed that it was possible to be both.

As well as describing that two classes are different, we may also wish
to describe that they are closely related, or that they are
\emph{subclasses}. Where one class is a subclass of another, we are saying
that everything that is true of the superclass is also true of the
subclass. Or, in terms of individuals, that every individual of the
subclass is also an individual of the superclass.

Next, we add two more classes and include the statement that they have
\verb~PizzaComponent~ as a superclass. We do this by adding a \verb~:super~
argument or \emph{frame} to our \verb~defclass~ statement. In Tawny-OWL the frames
can all be read in the same way. Read forwards, we can say \verb~PizzaBase~
has a superclass \verb~PizzaComponent~, or backwards \verb~PizzaComponent~ is a
superclass of \verb~PizzaBase~. Earlier, we say the \verb~:iri~ frame for
\verb~defontology~ which is read similarly -- \verb~pizza~ has the given IRI.

As every individual of, for example, \verb~PizzaBase~ is \verb~PizzaComponent~, and no
\verb~PizzaComponent~ individual can also be a \verb~Pizza~ this also implies that no
\verb~PizzaBase~ is a \verb~Pizza~. In otherwords, the disjointness is inherited
\footnote{In this ontology, we use a naming scheme using CamelCase, upper case
names for classes and, later, lower case properties. As with many parts of
ontology development, opinions differ as to whether this is good. With
Tawny-OWL it has the fortuitous advantage that it syntax-highlights nicely,
because it looks like Java}

\begin{tawny}
(defclass PizzaBase
  :super PizzaComponent)
(defclass PizzaTopping
  :super PizzaComponent)
\end{tawny}


As with the disjoint statement, this is little long winded; we have to name
the \verb~PizzaComponent~ superclass twice. Tawny-OWL provides a short cut for
this, with the \verb~as-subclasses~ function.

\begin{tawny}
(as-subclasses
 PizzaComponent
 (defclass PizzaBase)
 (defclass PizzaTopping))
\end{tawny}

We are still not complete; we asked the question previously, can you be both a
\verb~Pizza~ and a \verb~PizzaComponent~, to which the answer is no. We can apply the
same question, and get the same answer to a \verb~PizzaBase~ and \verb~PizzaTopping~.
These two, therefore, should also be disjoint. However, we can make a stronger
statement still. The only kind of \verb~PizzaComponent~ that there are either a
\verb~PizzaBase~ or a \verb~PizzaTopping~. We say that the \verb~PizzaComponent~ class is
\emph{covered} by its two subclasses. We can add both of these statements to the
ontology also.

\begin{tawny}
(as-subclasses
 PizzaComponent
 :disjoint :cover
 (defclass PizzaBase)
 (defclass PizzaTopping))
\end{tawny}

We now have the basic classes that we need to describe a pizza.
