org/the_pizza_ontology.org
** Properties

Now, we wish to describe more about ~Pizza~; in particular, we want to say
more about the relationship between ~Pizza~ and two ~PizzaComponent~ classes.
OWL provides a rich mechanism for describing relationships between individuals
and, in turn, how individuals of classes are related to each other. As well as
there being many different types of individuals, there are can be many
different types of relationships. It is the relationships to other classes or
individuals that allow us to describe classes, and it is for this reason that
the different types of relationships are called /properties/.

A ~Pizza~ is built from one or more ~PizzaComponent~ individuals; we first
define two properties [fn:: Actually, two /object/ properties, hence
~defoproperty~. We can also define /data/ properties, which we will see later]
to relate these two together, which we call ~hasComponent~ and
~isComponentOf~. The semantics of this statement is to say that we now have
two properties that we can use between individuals.

#+BEGIN_SRC clojure
(defoproperty hasComponent)
(defoproperty isComponentOf)
#+END_SRC

As with classes, there is more that we can say about these properties. In this
case, the properties are natual opposites or inverses of each other. The
semantics of this statement is that for an individual ~i~ which ~hasComponent~
~j~, we can say that ~j~ ~isComponentOf~ ~i~ also. 

#+BEGIN_SRC clojure
(as-inverse
 (defoproperty hasComponent)
 (defoproperty isComponentOf))
#+END_SRC

Again, the semantics here are actually between individuals, rather than
classes. This has an important consequence with the inverses. We might make
the statement that ~Pizza~ ~hasComponent~ ~PizzaComponent~, but this does not
allow us to infer that ~PizzaComponent~ ~isComponentOf~ ~Pizza~. Using an
every day analogy, just because all bicycles have wheels, we can not assume
that all wheels are parts of a bike; we *can* assume that where a bike has a
wheel, that wheel is part of a bike. This form of semantics is quite subtle,
and is an example of where statements made in OWL are saying less than most
people would assume footnote:[We will see examples of the opposite also --
statements which are stronger in OWL than the intuitive interpretation].

We now move on to describe the relationships between ~Pizza~ and both of
~PizzaBase~ and ~PizzaTopping~. For this, we will introduce three new parts of
OWL: subproperties, domain and range constraints and property characteristics,
which we define in Tawny-OWL as follows:

#+BEGIN_SRC clojure
(defoproperty hasTopping
  :super hasComponent
  :range PizzaTopping
  :domain Pizza)

(defoproperty hasBase
  :super hasComponent
  :characteristic :functional
  :range PizzaBase
  :domain Pizza)
#+END_SRC


First, we consider sub-properties, which are fairly analogous to sub-classes.
For example, if two individuals ~i~ and ~j~ are related so that ~i hasTopping
j~, then it is also true that ~i hasComponent j~.

Domain and range constraints describe the kind of entity that be at either end
of the property. So, for example, considering ~hasTopping~, we say that the
domain is ~Pizza~, so only instances of ~Pizza~ can have a topping, while the
range is ~PizzaTopping~ so only instances of ~PizzaTopping~ can be a topping. 

Finally, we introduce a /characteristic/. OWL has quite a few different
characteristics which will introduce over time; in this case /functional/
means means that there can be only one of these, so an individual has only a
single base.


** Populating the Ontology

We now have enough expressivity to describe quite a lot about pizzas. So, we
can now set about creating a larger set of toppings for our pizzas. First, we
describe some top level categories of types of topping. As before, we use
~as-subclasses~ function and state further that all of these classes are
disjoint. Here, we have not used the ~:cover~ option. This is deliberate,
because we cannot be sure that these classes describe all of the different
toppings we might have; there might be toppings which fall into none of these
categories. 

#+BEGIN_SRC clojure
(as-subclasses
 PizzaTopping
 :disjoint
 (defclass CheeseTopping)
 (defclass FishTopping)
 (defclass FruitTopping)
 (defclass HerbSpiceTopping)
 (defclass MeatTopping)
 (defclass NutTopping)
 (defclass SauceTopping)
 (defclass VegetableTopping))
#+END_SRC

When defining a large number of classes at once, Tawny-OWL also offers a
shortcut, which we now use to define a large number of classes at once, which
is ~declare-classes~. While this can be useful in a few specific
circumstances, these are quite limited because it does not allow addition of
any other attributes at the same time, and in particular labels which most
classes will need. In this case, we can generate a lot of classes in a short
space, which is useful in a tutorial document.

Neither ~MeatTopping~ nor ~FruitTopping~ are declared as ~:disjoint~ because
we have only put a single example.

#+BEGIN_SRC clojure
(as-subclasses
 CheeseTopping
 :disjoint

 (declare-classes
  GoatsCheeseTopping
  GorgonzolaTopping
  MozzarellaTopping
  ParmesanTopping))

(as-subclasses
 VegetableTopping
 :disjoint

 (declare-classes
  PepperTopping
  GarlicTopping
  PetitPoisTopping
  AsparagusTopping
  TomatoTopping
  ChilliPepperTopping))

(as-subclasses
 FruitTopping
 (defclass PineappleTopping))

(as-subclasses
 MeatTopping
 :disjoint
 (defclass HamTopping)
 (defclass PepperoniTopping))
#+END_SRC

