latex/the_pizza_ontology.tex


\subsection{Properties}
\label{sec-5-3}

Now, we wish to describe more about \verb~Pizza~; in particular, we want to say
more about the relationship between \verb~Pizza~ and two \verb~PizzaComponent~ classes.
OWL provides a rich mechanism for describing relationships between individuals
and, in turn, how individuals of classes are related to each other. As well as
there being many different types of individuals, there are can be many
different types of relationships. It is the relationships to other classes or
individuals that allow us to describe classes, and it is for this reason that
the different types of relationships are called \emph{properties}.

A \verb~Pizza~ is built from one or more \verb~PizzaComponent~ individuals; we first
define two properties \footnote{Actually, two \emph{object} properties, hence
\verb~defoproperty~. We can also define \emph{data} properties, which we will see later}
to relate these two together, which we call \verb~hasComponent~ and
\verb~isComponentOf~. The semantics of this statement is to say that we now have
two properties that we can use between individuals.

\begin{tawny}
(defoproperty hasComponent)
(defoproperty isComponentOf)
\end{tawny}

As with classes, there is more that we can say about these properties. In this
case, the properties are natual opposites or inverses of each other. The
semantics of this statement is that for an individual \verb~i~ which \verb~hasComponent~
\verb~j~, we can say that \verb~j~ \verb~isComponentOf~ \verb~i~ also. 

\begin{tawny}
(as-inverse
 (defoproperty hasComponent)
 (defoproperty isComponentOf))
\end{tawny}

Again, the semantics here are actually between individuals, rather than
classes. This has an important consequence with the inverses. We might make
the statement that \verb~Pizza~ \verb~hasComponent~ \verb~PizzaComponent~, but this does not
allow us to infer that \verb~PizzaComponent~ \verb~isComponentOf~ \verb~Pizza~. Using an
every day analogy, just because all bicycles have wheels, we can not assume
that all wheels are parts of a bike; we \textbf{can} assume that where a bike has a
wheel, that wheel is part of a bike. This form of semantics is quite subtle,
and is an example of where statements made in OWL are saying less than most
people would assume footnote:[We will see examples of the opposite also --
statements which are stronger in OWL than the intuitive interpretation].

We now move on to describe the relationships between \verb~Pizza~ and both of
\verb~PizzaBase~ and \verb~PizzaTopping~. For this, we will introduce three new parts of
OWL: subproperties, domain and range constraints and property characteristics,
which we define in Tawny-OWL as follows:

\begin{tawny}
(defoproperty hasTopping
  :super hasComponent
  :range PizzaTopping
  :domain Pizza)

(defoproperty hasBase
  :super hasComponent
  :characteristic :functional
  :range PizzaBase
  :domain Pizza)
\end{tawny}


First, we consider sub-properties, which are fairly analogous to sub-classes.
For example, if two individuals \verb~i~ and \verb~j~ are related so that \verb~i hasTopping j~, then it is also true that \verb~i hasComponent j~.

Domain and range constraints describe the kind of entity that be at either end
of the property. So, for example, considering \verb~hasTopping~, we say that the
domain is \verb~Pizza~, so only instances of \verb~Pizza~ can have a topping, while the
range is \verb~PizzaTopping~ so only instances of \verb~PizzaTopping~ can be a topping. 

Finally, we introduce a \emph{characteristic}. OWL has quite a few different
characteristics which will introduce over time; in this case \emph{functional}
means means that there can be only one of these, so an individual has only a
single base.


\subsection{Populating the Ontology}
\label{sec-5-4}

We now have enough expressivity to describe quite a lot about pizzas. So, we
can now set about creating a larger set of toppings for our pizzas. First, we
describe some top level categories of types of topping. As before, we use
\verb~as-subclasses~ function and state further that all of these classes are
disjoint. Here, we have not used the \verb~:cover~ option. This is deliberate,
because we cannot be sure that these classes describe all of the different
toppings we might have; there might be toppings which fall into none of these
categories. 

\begin{tawny}
(as-subclasses
 PizzaTopping
 :disjoint
 (defclass CheeseTopping)
 (defclass FishTopping)
 (defclass FruitTopping)
 (defclass HerbSpiceTopping)
 (defclass MeatTopping)
 (defclass NutTopping)
 (defclass SauceTopping)
 (defclass VegetableTopping))
\end{tawny}

When defining a large number of classes at once, Tawny-OWL also offers a
shortcut, which we now use to define a large number of classes at once, which
is \verb~declare-classes~. While this can be useful in a few specific
circumstances, these are quite limited because it does not allow addition of
any other attributes at the same time, and in particular labels which most
classes will need. In this case, we can generate a lot of classes in a short
space, which is useful in a tutorial document.

Neither \verb~MeatTopping~ nor \verb~FruitTopping~ are declared as \verb~:disjoint~ because
we have only put a single example.

\begin{tawny}
(as-subclasses
 CheeseTopping
 :disjoint

 (declare-classes
  GoatsCheeseTopping
  GorgonzolaTopping
  MozzarellaTopping
  ParmesanTopping))

(as-subclasses
 VegetableTopping
 :disjoint

 (declare-classes
  PepperTopping
  GarlicTopping
  PetitPoisTopping
  AsparagusTopping
  TomatoTopping
  ChilliPepperTopping))

(as-subclasses
 FruitTopping
 (defclass PineappleTopping))

(as-subclasses
 MeatTopping
 :disjoint
 (defclass HamTopping)
 (defclass PepperoniTopping))
\end{tawny}
