org/the_pizza_ontology.org
** Describing a Pizza

And, now finally, we have the basic concepts that we need to build a pizza.
First, we start off with a generic description of a pizza; we have already
defined the class above, so we want to extend the definition rather than
create a new one. We can achieve this using the ~class~ function:

#+BEGIN_SRC clojure
(class Pizza
   :super
   (some hasTopping PizzaTopping)
   (some hasBase PizzaBase))
#+END_SRC

This introduces several new features of Tawny-OWL:
 - this use of ~class~ requires that ~Pizza~ already be defined. In other
   words, we are extending an existing definition. If ~Pizza~ is not defined,
   this form will crash.
 - a new function ~some~
 - we create out first /unnamed/ classes from a class expression -- in this
   case ~(some hasTopping PizzaTopping)~.

The semantics of the last two of these are a little complex. Like a named
class (all of those we have seen so far), an unnamed class defines a set of
individuals, but it does so by combining other parts of the ontology. The
~some~ restriction describes a class of individuals with at least one
relationship of a particular type. So ~(some hasTopping PizzaTopping)~
describes the set of all individuals related by the ~hasTopping~ relationship
to at least one ~PizzaTopping~. Or alternatively, each ~Pizza~ must have a
~PizzaTopping~. Or, alternatively again, for each ~Pizza~ there must exist one
~PizzaTopping~; it is for this reason that this form of class is also known as
an /existential restriction/.

We combine the two statements to say that a ~Pizza~ must have at least one
base and at least one topping. Actually, we earlier defined ~hasBase~ with the
~:functional~ characteristic, so together this says that a ~Pizza~ must have
exactly one base.

Finally, we can build a specific pizza, and we start with one of the simplest
pizza, that is the margherita. This has two toppings, mozzarella and tomato.
The definition for this is as follows:

#+BEGIN_SRC clojure
(defclass MargheritaPizza
  :super
  Pizza
  (some hasTopping MozzarellaTopping)
  (some hasTopping TomatoTopping)
  (only hasTopping (or MozzarellaTopping TomatoTopping)))
#+END_SRC

The first part of this definition is similar to ~Pizza~. It says that a
~MargheritaPizza~ is a ~Pizza~ with two toppings, mozzarella and tomato. The
second part of the definition adds two new features of Tawny-OWL:

 - ~only~ a new function which returns a /universal restriction/
 - ~or~ which returns a /union restriction/

The ~or~ statement defines the set of individuals that is either
~MozzarellaTopping~ or ~TomatoTopping~. The ~only~ statement defines the set
of individuals whose toppings are either ~MozzarellaTopping~ or
~TomatoTopping~. One important sting in the tail of ~only~ is that it does
*NOT* state that these individuals have any toppings at all. So ~(only
hasTopping MozzarellaTopping)~ would cover a ~Pizza~ with only
~MozzarellaTopping~, but also many other things, including things which are
not ~Pizza~ at all. Logically, this makes sense, but it is counter-intuitive
[fn::Except to logicians, obviously, to whom it all makes perfect sense.].

For completeness, we also define ~HawaiianPizza~ [fn::Pizza names are, sadly,
not standardized between countries or resturants, so I've picked on which is
quite widely known. Apologies to any Italian readers for this and any other
culinary disasters which this book implies really are pizza.].

#+BEGIN_SRC clojure
(defclass HawaiianPizza
  :super
  Pizza
  (some hasTopping MozzarellaTopping)
  (some hasTopping TomatoTopping)
  (some hasTopping HamTopping)
  (some hasTopping PineappleTopping)
  (only hasTopping
        (or MozzarellaTopping TomatoTopping HamTopping PineappleTopping)))
#+END_SRC

We can now check that this works as expected by using the ~subclass?~ and
~subclasses~ functions at the REPL.

#+BEGIN_EXAMPLE
take.wing.the-pizza-ontology> (subclass? Pizza MargheritaPizza)
true
take.wing.the-pizza-ontology> (subclasses Pizza)
#{#<OWLClassImpl <http://purl.org/ontolink/take-wing/pizza#HawaiianPizza>>
  #<OWLClassImpl <http://purl.org/ontolink/take-wing/pizza#MargheritaPizza>>}
#+END_EXAMPLE

** A simple pattern

The last definition is rather unsatisfying for two reasons. Firstly, the
multiple uses of ~some hasTopping~ and secondly because the toppings are
duplicated between the universal and existential restrictions. Two features of
Tawny-OWL enable us to work around these problems. 

Firstly, the ~some~ function is /variadic/ and take a single property but any
number of classes. We use this feature to shorten the definition of
~AmericanPizza~. 

#+BEGIN_SRC clojure
(defclass AmericanPizza
  :super
  Pizza
  (some hasTopping MozzarellaTopping
        TomatoTopping PepperoniTopping)
  (only hasTopping (or MozzarellaTopping TomatoTopping PepperoniTopping)))
#+END_SRC

The single ~some~ function call here expands to three existential
restrictions, each of which becomes a super class of ~AmericanPizza~ --
mirroring the definition of ~HawaiianPizza~.

This definition, however, still leaves the duplication between the two sets of
restrictions. This pattern is frequent enough that Tawny-OWL provides special
support for it in the form of the ~some-only~ function, which we use to define
the next pizza.

#+BEGIN_SRC clojure
(defclass AmericanHotPizza
  :super
  Pizza
  (some-only hasTopping MozzarellaTopping TomatoTopping
             PepperoniTopping ChilliPepperTopping))
#+END_SRC

The ~some-only~ function is Tawny-OWL's implementation of the /closure/ axiom.
Similarly, the use of ~:cover~ described earlier implements the /covering/
axiom. These are the only two patterns which are directly supported by the
core of Tawny-OWL (i.e. the namespace ~tawny.owl~). In later sections, though,
we will see how to exploit the programmatic nature of Tawny-OWL to build
arbitrary new patterns for yourself.


** Defined Classes
<<defined>>

So far all of the classes that we have written are /primitive/. Rather than a
statement about complexity, this means that as they stand, they cannot be used
to infer new facts. So, for example, we know that a individual
~MargheritaPizza~ will have a ~MozzarellaTopping~ and a ~TomatoTopping~, but
given an arbitrary pizza we cannot determine whether it is a margherita. Or,
mozzarella and tomato toppings are /necessary/ for a margherita, but they are
not sufficient.

Defined classes allow us to take advantage of the power of computational
reasoning. Let us try a simple example:

#+BEGIN_SRC clojure
(defclass VegetarianPizza
  :equivalent
  (and Pizza
       (only hasTopping
             (not (or MeatTopping FishTopping)))))
#+END_SRC

Here, we define a ~VegetarianPizza~ as a ~Pizza~ with only ~MeatTopping~ or
~FishTopping~.


** TODO

 - Then move onto defined classes -- also including and/or/not
 - Then add in reasoners
 - Then stop



