latex/the_pizza_ontology.tex

\subsection{Describing a Pizza}
\label{sec-5-5}

And, now finally, we have the basic concepts that we need to build a pizza.
First, we start off with a generic description of a pizza; we have already
defined the class above, so we want to extend the definition rather than
create a new one. We can achieve this using the \verb~class~ function:

\begin{tawny}
(class Pizza
   :super
   (some hasTopping PizzaTopping)
   (some hasBase PizzaBase))
\end{tawny}

This introduces several new features of Tawny-OWL:
\begin{itemize}
\item this use of \verb~class~ requires that \verb~Pizza~ already be defined. In other
words, we are extending an existing definition. If \verb~Pizza~ is not defined,
this form will crash.
\item a new function \verb~some~
\item we create out first \emph{unnamed} classes from a class expression -- in this
case \verb~(some hasTopping PizzaTopping)~.
\end{itemize}

The semantics of the last two of these are a little complex. Like a named
class (all of those we have seen so far), an unnamed class defines a set of
individuals, but it does so by combining other parts of the ontology. The
\verb~some~ restriction describes a class of individuals with at least one
relationship of a particular type. So \verb~(some hasTopping PizzaTopping)~
describes the set of all individuals related by the \verb~hasTopping~ relationship
to at least one \verb~PizzaTopping~. Or alternatively, each \verb~Pizza~ must have a
\verb~PizzaTopping~. Or, alternatively again, for each \verb~Pizza~ there must exist one
\verb~PizzaTopping~; it is for this reason that this form of class is also known as
an \emph{existential restriction}.

We combine the two statements to say that a \verb~Pizza~ must have at least one
base and at least one topping. Actually, we earlier defined \verb~hasBase~ with the
\verb~:functional~ characteristic, so together this says that a \verb~Pizza~ must have
exactly one base.

Finally, we can build a specific pizza, and we start with one of the simplest
pizza, that is the margherita. This has two toppings, mozzarella and tomato.
The definition for this is as follows:

\begin{tawny}
(defclass MargheritaPizza
  :super
  Pizza
  (some hasTopping MozzarellaTopping)
  (some hasTopping TomatoTopping)
  (only hasTopping (or MozzarellaTopping TomatoTopping)))
\end{tawny}

The first part of this definition is similar to \verb~Pizza~. It says that a
\verb~MargheritaPizza~ is a \verb~Pizza~ with two toppings, mozzarella and tomato. The
second part of the definition adds two new features of Tawny-OWL:

\begin{itemize}
\item \verb~only~ a new function which returns a \emph{universal restriction}
\item \verb~or~ which returns a \emph{union restriction}
\end{itemize}

The \verb~or~ statement defines the set of individuals that is either
\verb~MozzarellaTopping~ or \verb~TomatoTopping~. The \verb~only~ statement defines the set
of individuals whose toppings are either \verb~MozzarellaTopping~ or
\verb~TomatoTopping~. One important sting in the tail of \verb~only~ is that it does
\textbf{NOT} state that these individuals have any toppings at all. So \verb~(only hasTopping MozzarellaTopping)~ would cover a \verb~Pizza~ with only
\verb~MozzarellaTopping~, but also many other things, including things which are
not \verb~Pizza~ at all. Logically, this makes sense, but it is counter-intuitive
\footnote{Except to logicians, obviously, to whom it all makes perfect sense.}.

For completeness, we also define \verb~HawaiianPizza~ \footnote{Pizza names are, sadly,
not standardized between countries or resturants, so I've picked on which is
quite widely known. Apologies to any Italian readers for this and any other
culinary disasters which this book implies really are pizza.}.

\begin{tawny}
(defclass HawaiianPizza
  :super
  Pizza
  (some hasTopping MozzarellaTopping)
  (some hasTopping TomatoTopping)
  (some hasTopping HamTopping)
  (some hasTopping PineappleTopping)
  (only hasTopping
	(or MozzarellaTopping TomatoTopping HamTopping PineappleTopping)))
\end{tawny}

We can now check that this works as expected by using the \verb~subclass?~ and
\verb~subclasses~ functions at the REPL.

\begin{verbatim}
take.wing.the-pizza-ontology> (subclass? Pizza MargheritaPizza)
true
take.wing.the-pizza-ontology> (subclasses Pizza)
#{#<OWLClassImpl <http://purl.org/ontolink/take-wing/pizza#HawaiianPizza>>
  #<OWLClassImpl <http://purl.org/ontolink/take-wing/pizza#MargheritaPizza>>}
\end{verbatim}

\subsection{A simple pattern}
\label{sec-5-6}

The last definition is rather unsatisfying for two reasons. Firstly, the
multiple uses of \verb~some hasTopping~ and secondly because the toppings are
duplicated between the universal and existential restrictions. Two features of
Tawny-OWL enable us to work around these problems. 

Firstly, the \verb~some~ function is \emph{variadic} and take a single property but any
number of classes. We use this feature to shorten the definition of
\verb~AmericanPizza~. 

\begin{tawny}
(defclass AmericanPizza
  :super
  Pizza
  (some hasTopping MozzarellaTopping
	TomatoTopping PepperoniTopping)
  (only hasTopping (or MozzarellaTopping TomatoTopping PepperoniTopping)))
\end{tawny}

The single \verb~some~ function call here expands to three existential
restrictions, each of which becomes a super class of \verb~AmericanPizza~ --
mirroring the definition of \verb~HawaiianPizza~.

This definition, however, still leaves the duplication between the two sets of
restrictions. This pattern is frequent enough that Tawny-OWL provides special
support for it in the form of the \verb~some-only~ function, which we use to define
the next pizza.

\begin{tawny}
(defclass AmericanHotPizza
  :super
  Pizza
  (some-only hasTopping MozzarellaTopping TomatoTopping
	     PepperoniTopping ChilliPepperTopping))
\end{tawny}

The \verb~some-only~ function is Tawny-OWL's implementation of the \emph{closure} axiom.
Similarly, the use of \verb~:cover~ described earlier implements the \emph{covering}
axiom. These are the only two patterns which are directly supported by the
core of Tawny-OWL (i.e. the namespace \verb~tawny.owl~). In later sections, though,
we will see how to exploit the programmatic nature of Tawny-OWL to build
arbitrary new patterns for yourself.


\subsection{Defined Classes}
\label{sec-5-7}
\label{defined}

So far all of the classes that we have written are \emph{primitive}. Rather than a
statement about complexity, this means that as they stand, they cannot be used
to infer new facts. So, for example, we know that a individual
\verb~MargheritaPizza~ will have a \verb~MozzarellaTopping~ and a \verb~TomatoTopping~, but
given an arbitrary pizza we cannot determine whether it is a margherita. Or,
mozzarella and tomato toppings are \emph{necessary} for a margherita, but they are
not sufficient.

Defined classes allow us to take advantage of the power of computational
reasoning. Let us try a simple example:

\begin{tawny}
(defclass VegetarianPizza
  :equivalent
  (and Pizza
       (only hasTopping
	     (not (or MeatTopping FishTopping)))))
\end{tawny}

Here, we define a \verb~VegetarianPizza~ as a \verb~Pizza~ with only \verb~MeatTopping~ or
\verb~FishTopping~.


\subsection{{\bfseries\sffamily TODO} }
\label{sec-5-8}

\begin{itemize}
\item Then move onto defined classes -- also including and/or/not
\item Then add in reasoners
\item Then stop
\end{itemize}

